package CasePlanner;

import CasePlanner.Program;

/** Только когда все сделал понял всю прелесть обобщенного наследования из абстракного класса в котором изначально пропи
 * сываеются всевозможные методы, поэтому у меня тут не очень красиво по итогу вышло но все переделывать нет уже сил,
 * но я многому научился и многое понял)) в след задачи постараюсь реализовать лучше*/


public class Main {
    public static void main(String[] args) {
        Program start = new Program();
        start.start();
    }
}
